mpi_address2.sh

curl --location --request POST 'http://localhost:9090/psim_webservice/IdMWebService/' \
--header 'Content-Type: text/xml' \
--data-raw '<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:PRPA_IN201305UV02 xmlns="urn:hl7-org:v3" xmlns:ns2="http://vaww.oed.oit.va.gov"><id extension="MCID-DVP_veteran-verification2022-05-05T10:57:02.041594Z" root="2.16.840.1.113883.3.933"/><creationTime value="20220505065702050"/><versionCode code="4.0"/><interactionId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode code="AL"/><receiver typeCode="RCV"><device classCode="DEV" determinerCode="INSTANCE"><id root="2.16.840.1.113883.4.349"/></device></receiver><sender typeCode="SND"><device classCode="DEV" determinerCode="INSTANCE"><id extension="666LHSE" root="2.16.840.1.113883.3.933"/><asAgent xmlns="" xmlns:ns3="urn:hl7-org:v3" classCode="AGNT"><representedOrganization classCode="ORG" determinerCode="INSTANCE"><ns3:id extension="666LHSG" root="2.16.840.1.113883.4.349"/></representedOrganization></asAgent></device></sender><controlActProcess classCode="CACT" moodCode="EVN"><code code="PRPA_TE201305UV02" codeSystem="2.16.840.1.113883.1.6"/><dataEnterer contextControlCode="AP" typeCode="ENT"><assignedPerson classCode="ASSIGNED"><id extension="666LHSG" root="2.16.840.1.113883.4.349"/><assignedPerson xmlns="" xmlns:ns3="urn:hl7-org:v3" classCode="PSN" determinerCode="INSTANCE"><ns3:name><family>LIGHTHOUSE</family></ns3:name></assignedPerson><representedOrganization xmlns="" xmlns:ns3="urn:hl7-org:v3" classCode="ORG" determinerCode="INSTANCE"><ns3:id extension="UID" root="2.16.840.1.113883.4.349"/><ns3:code code="KEY"/><ns3:telecom value="10.226.86.189"/></representedOrganization></assignedPerson></dataEnterer><queryByParameter><queryId extension="18204" root="2.16.840.1.113883.3.933"/><statusCode code="new"/><modifyCode code="MVI.COMP1.RMS"/><responseElementGroupId extension="PV" root="2.16.840.1.113883.4.349"/><initialQuantity value="1"/><parameterList><patientAddress><value><streetAddressLine xmlns="" xmlns:ns3="urn:hl7-org:v3">BEHIND TAHINI RIVER</streetAddressLine><postalCode>78741</postalCode><city xmlns="" xmlns:ns3="urn:hl7-org:v3">Austin</city><state xmlns="" xmlns:ns3="urn:hl7-org:v3">TX</state><country xmlns="" xmlns:ns3="urn:hl7-org:v3">USA</country></value><semanticsText>PatientAddress</semanticsText></patientAddress></parameterList></queryByParameter></controlActProcess></ns2:PRPA_IN201305UV02></S:Body></S:Envelope>'
